# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Install Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'heroku-toolbelt'
brew 'mackup'
brew 'openssl'
brew 'libffi'
brew 'libyaml'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree'

# Development
brew 'asdf'
brew 'mysql'
brew 'postgres'
brew 'redis'
brew 'kubernetes-cli'
brew 'kubernetes-helm'

# Apps
cask '1password'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'insomnia'
cask 'iterm2'
cask 'postman'
cask 'polymail'
cask 'recordit'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'tableplus'
cask 'the-unarchiver'
cask 'ubiquiti-unifi-controller'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-fira-code'

# To have launchd start at login:
brew services start mysql
brew services start postgresql
brew services start redis
