# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'heroku-toolbelt'
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'mysql'
brew 'postgres'
brew 'redis'
brew 'node'
brew 'rbenv'
brew 'ruby-build'

# Apps
cask '1password'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'polymail'
cask 'postman'
cask 'recordit'
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'utorrent'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
