# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'heroku/brew'

# Install Binaries
brew 'automake'
brew 'autoconf'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'gpg'
brew 'heroku'
brew 'mackup'
brew 'openssl'
brew 'readline'
brew 'unixodbc'
brew 'unzip'
brew 'libffi'
brew 'libyaml'
brew 'libtool'
brew 'libxslt'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree'

# Development
brew 'asdf'
brew 'mysql'
brew 'postgres'
brew 'redis'

# Apps
cask '1password'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'brave-browser'
cask 'google-backup-and-sync'
cask 'insomnia'
cask 'iterm2'
cask 'muzzle'
cask 'postman'
cask 'polymail'
cask 'recordit'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'tableplus'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-fira-code'
